app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT "cats".* FROM "cats" ORDER BY "cats"."created_at" DESC

  def destroy
    @cat.destroy!
---
DELETE FROM "cats" WHERE "cats"."id" = 123

    def set_cat
      @cat = Cat.find(params.expect(:id))
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = 94 LIMIT 1