app/controllers/static_controller.rb

INSERT INTO "carts" ("interested_user_id", "carted_cat_id", "created_at", "updated_at") VALUES (43, 125, '2025-11-04 14:25:31.875672', '2025-11-04 14:25:31.875672') RETURNING "id"
SELECT "cats".* FROM "cats" WHERE "cats"."id" = 128 LIMIT 1
---
  def cart

    @tempcart = [] # Array temporaire qui contient le panier du user à traiter dans la view cart (qu'il soit connecté ou pas)

      if current_user # SI LOG ON

        if session[:cart] && session[:cart] != []
          for cat in session[:cart] # On copie l'intégralité des chats sauvegardés dans les cookies dans la BDD (au cas où l'user vient de se connecter mais avait déjà mis des trucs dans le panier)
            Cart.create(interested_user: current_user, carted_cat_id: cat)
            puts "Cookie transféré en BDD"
          end
        end

        session[:cart] = [] # on vide le cookie après avoir transféré dans la base de données
        puts "Session vidée du cart"

        for cat in current_user.carted_cats do # On met dans notre array temporaire l'ensemble des chats de la BDD mis en panier
          @tempcart.push(cat)
          puts "Cat transféré en tempcart"
        end

      else # SI LOG OUT

        if session[:cart]
          for cat in session[:cart]
            @tempcart.push(Cat.find(cat))

INSERT INTO "carts" ("interested_user_id", "carted_cat_id", "created_at", "updated_at") VALUES (43, 125, '2025-11-04 14:34:19.794355', '2025-11-04 14:34:19.794355') RETURNING "id"
---
  def add_to_cart
    if current_user # Si connecté, on stocke dans la BDD direct
      Cart.create(interested_user: current_user, carted_cat_id: params[:format])

DELETE FROM "carts" WHERE "carts"."id" = 21
DELETE FROM "cats" WHERE "cats"."id" = 153
SELECT "carts".* FROM "carts" WHERE "carts"."interested_user_id" = 64 AND "carts"."carted_cat_id" = 153
---
  def remove_from_cart
    if current_user
      Cart.where(interested_user: current_user, carted_cat_id: params[:format]).first.destroy