app/views/cats/_cat_comments.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 48 LIMIT 1
---
                <p>
                    <strong><%=comment.user.email.split("@")[0].split(".").join(" ").titleize%></strong> says :<br>