app/views/cats/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "cat_ownerships" ON "users"."id" = "cat_ownerships"."user_id" WHERE "cat_ownerships"."cat_id" = 123
---
    <% @cats.each do |cat| %>
      <% unless cat.users.include?(current_user) %>