app/views/cats/show.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "cat_ownerships" ON "users"."id" = "cat_ownerships"."user_id" WHERE "cat_ownerships"."cat_id" = 135
---
</p>
<p><small>This cat has been bought <%=@cat.users.count%> times already !</small></p>